# 데이터 프레임 행, 열 삭제하기

In [11]:
import pandas as pd
friends =[
    {'age':15,'job':'student'},
    {'age':20,'job':'developer'},
    {'age':30,'job':'teacher'}
]
index = ['John','Jenny','Nate']
column = ['age','job']
df = pd.DataFrame(friends,
index= index,
columns=column
)
df

       age        job
John    15    student
Jenny   20  developer
Nate    30    teacher

In [12]:
df.drop(['John','Nate'])    #John, Nate 없애기

       age        job
Jenny   20  developer

In [13]:
df = df.drop(['John','Nate'])
df

       age        job
Jenny   20  developer

In [20]:
friends =[
    {'age':15,'job':'student'},
    {'age':20,'job':'developer'},
    {'age':30,'job':'teacher'}
]
index = ['John','Jenny','Nate']
column = ['age','job']
df = pd.DataFrame(friends,
index= index,
columns=column
)
df

       age        job
John    15    student
Jenny   20  developer
Nate    30    teacher

In [21]:
#inplace df에 바로적용
df.drop(['John','Nate'],inplace = True)
df

       age        job
Jenny   20  developer

In [32]:
friends =[
    {'name':'John','age':15,'job':'student'},
    {'name':'Ben','age':20,'job':'developer'},
    {'name':'Jenny','age':30,'job':'teacher'}
]
column = ['name','age','job']
df = pd.DataFrame(friends,
columns=column
)
df

    name  age        job
0   John   15    student
1    Ben   20  developer
2  Jenny   30    teacher

In [33]:
df = df.drop(df.index[[0,2]])  #John과 Jenny 삭제
#원하는 row 삭제
df

  name  age        job
1  Ben   20  developer

In [37]:
friends =[
    {'name':'John','age':15,'job':'student'},
    {'name':'Ben','age':25,'job':'developer'},
    {'name':'Jenny','age':30,'job':'teacher'}
]
column = ['name','age','job']
df = pd.DataFrame(friends,
columns=column
)
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

# 조건에 의한 삭제

In [38]:
df = df[df.age > 20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [46]:
friends =[
    {'name':'John','age':15,'job':'student'},
    {'name':'Ben','age':25,'job':'developer'},
    {'name':'Jenny','age':30,'job':'teacher'}
]
column = ['name','age','job']
df = pd.DataFrame(friends,
columns=column
)
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [47]:
df.drop('age', axis= 1,inplace =True)
#column 중에서 age를 삭제
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher